espressif/arduino-esp32/boards.txt
feathers2.menu.CPUFreq.240=240MHz (WiFi)
feathers2.menu.CPUFreq.240.build.f_cpu=240000000L
feathers2.menu.CPUFreq.160=160MHz (WiFi)
feathers2.menu.CPUFreq.160.build.f_cpu=160000000L
feathers2.menu.CPUFreq.80=80MHz (WiFi)
feathers2.menu.CPUFreq.80.build.f_cpu=80000000L
feathers2.menu.CPUFreq.40=40MHz
feathers2.menu.CPUFreq.40.build.f_cpu=40000000L
feathers2.menu.CPUFreq.20=20MHz
feathers2.menu.CPUFreq.20.build.f_cpu=20000000L
feathers2.menu.CPUFreq.10=10MHz
feathers2.menu.CPUFreq.10.build.f_cpu=10000000L

feathers2.menu.FlashSize.16M=16MB (128Mb)
feathers2.menu.FlashSize.16M.build.flash_size=16MB
feathers2.menu.FlashSize.4M=4MB (32Mb)
feathers2.menu.FlashSize.4M.build.flash_size=4MB
feathers2.menu.FlashSize.8M=8MB (64Mb)
feathers2.menu.FlashSize.8M.build.flash_size=8MB
feathers2.menu.FlashSize.8M.build.partitions=default_8MB
feathers2.menu.FlashSize.2M=2MB (16Mb)
feathers2.menu.FlashSize.2M.build.flash_size=2MB
feathers2.menu.FlashSize.2M.build.partitions=minimal

feathers2.menu.UploadSpeed.921600=921600
feathers2.menu.UploadSpeed.921600.upload.speed=921600
feathers2.menu.UploadSpeed.115200=115200
feathers2.menu.UploadSpeed.115200.upload.speed=115200
feathers2.menu.UploadSpeed.256000.windows=256000
feathers2.menu.UploadSpeed.256000.upload.speed=256000
feathers2.menu.UploadSpeed.230400.windows.upload.speed=256000
feathers2.menu.UploadSpeed.230400=230400
feathers2.menu.UploadSpeed.230400.upload.speed=230400
feathers2.menu.UploadSpeed.460800.linux=460800
feathers2.menu.UploadSpeed.460800.macosx=460800
feathers2.menu.UploadSpeed.460800.upload.speed=460800

feathers2.menu.DebugLevel.none=None
feathers2.menu.DebugLevel.none.build.code_debug=0
feathers2.menu.DebugLevel.error=Error
feathers2.menu.DebugLevel.error.build.code_debug=1
feathers2.menu.DebugLevel.warn=Warn
feathers2.menu.DebugLevel.warn.build.code_debug=2
feathers2.menu.DebugLevel.info=Info
feathers2.menu.DebugLevel.info.build.code_debug=3
feathers2.menu.DebugLevel.debug=Debug
feathers2.menu.DebugLevel.debug.build.code_debug=4
feathers2.menu.DebugLevel.verbose=Verbose
feathers2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

tinys2.name=UM TinyS2
tinys2.vid.0=0x303a
tinys2.pid.0=0x8001

tinys2.upload.tool=esptool_py
tinys2.upload.maximum_size=1310720
tinys2.upload.maximum_data_size=327680
tinys2.upload.flags=
tinys2.upload.extra_flags=
tinys2.upload.use_1200bps_touch=true
tinys2.upload.wait_for_upload_port=true

tinys2.serial.disableDTR=false
tinys2.serial.disableRTS=false

tinys2.build.tarch=xtensa
tinys2.build.bootloader_addr=0x1000
tinys2.build.target=esp32s2
tinys2.build.mcu=esp32s2
tinys2.build.core=esp32
tinys2.build.variant=um_tinys2
tinys2.build.board=TINYS2

tinys2.build.serial=1
tinys2.build.f_cpu=240000000L
tinys2.build.flash_size=4MB
tinys2.build.flash_freq=80m
tinys2.build.flash_mode=dio
tinys2.build.boot=qio
tinys2.build.partitions=default
tinys2.build.defines=

tinys2.menu.SerialMode.cdc=USB CDC
tinys2.menu.SerialMode.cdc.build.serial=1
tinys2.menu.SerialMode.default=UART0
tinys2.menu.SerialMode.default.build.serial=0

tinys2.menu.PSRAM.enabled=Enabled
tinys2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
tinys2.menu.PSRAM.disabled=Disabled
tinys2.menu.PSRAM.disabled.build.defines=

tinys2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
tinys2.menu.PartitionScheme.default.build.partitions=default
tinys2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
tinys2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
tinys2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
tinys2.menu.PartitionScheme.minimal.build.partitions=minimal
tinys2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
tinys2.menu.PartitionScheme.no_ota.build.partitions=no_ota
tinys2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
tinys2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
tinys2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
tinys2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
tinys2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
tinys2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
tinys2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
tinys2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
tinys2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
tinys2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
tinys2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
tinys2.menu.PartitionScheme.huge_app.build.partitions=huge_app
tinys2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
tinys2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
tinys2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
tinys2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

tinys2.menu.CPUFreq.240=240MHz (WiFi)
tinys2.menu.CPUFreq.240.build.f_cpu=240000000L
tinys2.menu.CPUFreq.160=160MHz (WiFi)
tinys2.menu.CPUFreq.160.build.f_cpu=160000000L
tinys2.menu.CPUFreq.80=80MHz (WiFi)
tinys2.menu.CPUFreq.80.build.f_cpu=80000000L
tinys2.menu.CPUFreq.40=40MHz
tinys2.menu.CPUFreq.40.build.f_cpu=40000000L
tinys2.menu.CPUFreq.20=20MHz
tinys2.menu.CPUFreq.20.build.f_cpu=20000000L
tinys2.menu.CPUFreq.10=10MHz
tinys2.menu.CPUFreq.10.build.f_cpu=10000000L

tinys2.menu.FlashSize.4M=4MB (32Mb)
tinys2.menu.FlashSize.4M.build.flash_size=4MB
tinys2.menu.FlashSize.2M=2MB (16Mb)
tinys2.menu.FlashSize.2M.build.flash_size=2MB
tinys2.menu.FlashSize.2M.build.partitions=minimal

tinys2.menu.UploadSpeed.921600=921600
tinys2.menu.UploadSpeed.921600.upload.speed=921600
tinys2.menu.UploadSpeed.115200=115200
tinys2.menu.UploadSpeed.115200.upload.speed=115200
tinys2.menu.UploadSpeed.256000.windows=256000
tinys2.menu.UploadSpeed.256000.upload.speed=256000
tinys2.menu.UploadSpeed.230400.windows.upload.speed=256000
tinys2.menu.UploadSpeed.230400=230400
tinys2.menu.UploadSpeed.230400.upload.speed=230400
tinys2.menu.UploadSpeed.460800.linux=460800
tinys2.menu.UploadSpeed.460800.macosx=460800
tinys2.menu.UploadSpeed.460800.upload.speed=460800


tinys2.menu.DebugLevel.none=None
tinys2.menu.DebugLevel.none.build.code_debug=0
tinys2.menu.DebugLevel.error=Error
tinys2.menu.DebugLevel.error.build.code_debug=1
tinys2.menu.DebugLevel.warn=Warn
tinys2.menu.DebugLevel.warn.build.code_debug=2
tinys2.menu.DebugLevel.info=Info
tinys2.menu.DebugLevel.info.build.code_debug=3
tinys2.menu.DebugLevel.debug=Debug
tinys2.menu.DebugLevel.debug.build.code_debug=4
tinys2.menu.DebugLevel.verbose=Verbose
tinys2.menu.DebugLevel.verbose.build.code_debug=5

