espressif/arduino-esp32/boards.txt
##############################################################

adafruit_magtag29_esp32s2.name=Adafruit MagTag 2.9"
adafruit_magtag29_esp32s2.vid.0=0x239A
adafruit_magtag29_esp32s2.pid.0=0x80DF
adafruit_magtag29_esp32s2.vid.1=0x239A
adafruit_magtag29_esp32s2.pid.1=0x00DF
adafruit_magtag29_esp32s2.vid.1=0x239A
adafruit_magtag29_esp32s2.pid.1=0x80E0

adafruit_magtag29_esp32s2.upload.tool=esptool_py
adafruit_magtag29_esp32s2.upload.maximum_size=1310720
adafruit_magtag29_esp32s2.upload.maximum_data_size=327680
adafruit_magtag29_esp32s2.upload.flags=
adafruit_magtag29_esp32s2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_magtag29_esp32s2.upload.use_1200bps_touch=true
adafruit_magtag29_esp32s2.upload.wait_for_upload_port=true

adafruit_magtag29_esp32s2.serial.disableDTR=false
adafruit_magtag29_esp32s2.serial.disableRTS=false

adafruit_magtag29_esp32s2.build.tarch=xtensa
adafruit_magtag29_esp32s2.build.bootloader_addr=0x1000
adafruit_magtag29_esp32s2.build.target=esp32s2
adafruit_magtag29_esp32s2.build.mcu=esp32s2
adafruit_magtag29_esp32s2.build.core=esp32
adafruit_magtag29_esp32s2.build.variant=adafruit_magtag29_esp32s2
adafruit_magtag29_esp32s2.build.board=MAGTAG29_ESP32S2

adafruit_magtag29_esp32s2.build.serial=0
adafruit_magtag29_esp32s2.build.f_cpu=240000000L
adafruit_magtag29_esp32s2.build.flash_size=4MB
adafruit_magtag29_esp32s2.build.flash_freq=80m
adafruit_magtag29_esp32s2.build.flash_mode=qio
adafruit_magtag29_esp32s2.build.boot=qio
adafruit_magtag29_esp32s2.build.partitions=default
adafruit_magtag29_esp32s2.build.defines=

adafruit_magtag29_esp32s2.menu.SerialMode.cdc=USB CDC
adafruit_magtag29_esp32s2.menu.SerialMode.cdc.build.serial=1
adafruit_magtag29_esp32s2.menu.SerialMode.default=UART0
adafruit_magtag29_esp32s2.menu.SerialMode.default.build.serial=0

adafruit_magtag29_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_magtag29_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_magtag29_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_magtag29_esp32s2.menu.PSRAM.disabled.build.defines=

adafruit_magtag29_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.default.build.partitions=default
adafruit_magtag29_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
adafruit_magtag29_esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_magtag29_esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
adafruit_magtag29_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
adafruit_magtag29_esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
adafruit_magtag29_esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
adafruit_magtag29_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_magtag29_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

adafruit_magtag29_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.40=40MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.20=20MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.10=10MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_magtag29_esp32s2.menu.FlashMode.qio=QIO
adafruit_magtag29_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_magtag29_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_magtag29_esp32s2.menu.FlashMode.dio=DIO
adafruit_magtag29_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_magtag29_esp32s2.menu.FlashMode.dio.build.boot=dio
adafruit_magtag29_esp32s2.menu.FlashMode.qout=QOUT
adafruit_magtag29_esp32s2.menu.FlashMode.qout.build.flash_mode=dout
adafruit_magtag29_esp32s2.menu.FlashMode.qout.build.boot=qout
adafruit_magtag29_esp32s2.menu.FlashMode.dout=DOUT
adafruit_magtag29_esp32s2.menu.FlashMode.dout.build.flash_mode=dout
adafruit_magtag29_esp32s2.menu.FlashMode.dout.build.boot=dout

adafruit_magtag29_esp32s2.menu.FlashFreq.80=80MHz
adafruit_magtag29_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_magtag29_esp32s2.menu.FlashFreq.40=40MHz
adafruit_magtag29_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

