espressif/arduino-esp32/boards.txt
##############################################################

esp32doit-espduino.name=DOIT ESPduino32

esp32doit-espduino.upload.tool=esptool
esp32doit-espduino.upload.maximum_size=1310720
esp32doit-espduino.upload.maximum_data_size=327680
esp32doit-espduino.upload.wait_for_upload_port=true
esp32doit-espduino.upload.extra_flags=

esp32doit-espduino.serial.disableDTR=true
esp32doit-espduino.serial.disableRTS=true

esp32doit-espduino.build.tarch=xtensa
esp32doit-espduino.build.bootloader_addr=0x1000
esp32doit-espduino.build.target=esp32
esp32doit-espduino.build.mcu=esp32
esp32doit-espduino.build.core=esp32
esp32doit-espduino.build.variant=doitESPduino32
esp32doit-espduino.build.board=ESP32_DEV

esp32doit-espduino.build.f_cpu=240000000L
esp32doit-espduino.build.flash_mode=dio
esp32doit-espduino.build.flash_size=4MB
esp32doit-espduino.build.boot=dio
esp32doit-espduino.build.partitions=default
esp32doit-espduino.build.defines=

esp32doit-espduino.menu.FlashFreq.80=80MHz
esp32doit-espduino.menu.FlashFreq.80.build.flash_freq=80m
esp32doit-espduino.menu.FlashFreq.40=40MHz
esp32doit-espduino.menu.FlashFreq.40.build.flash_freq=40m

esp32doit-espduino.menu.UploadSpeed.921600=921600
esp32doit-espduino.menu.UploadSpeed.921600.upload.speed=921600
esp32doit-espduino.menu.UploadSpeed.115200=115200
esp32doit-espduino.menu.UploadSpeed.115200.upload.speed=115200
esp32doit-espduino.menu.UploadSpeed.256000.windows=256000
esp32doit-espduino.menu.UploadSpeed.256000.upload.speed=256000
esp32doit-espduino.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32doit-espduino.menu.UploadSpeed.230400=230400
esp32doit-espduino.menu.UploadSpeed.230400.upload.speed=230400
esp32doit-espduino.menu.UploadSpeed.460800.linux=460800
esp32doit-espduino.menu.UploadSpeed.460800.macosx=460800
esp32doit-espduino.menu.UploadSpeed.460800.upload.speed=460800
esp32doit-espduino.menu.UploadSpeed.512000.windows=512000
esp32doit-espduino.menu.UploadSpeed.512000.upload.speed=512000

esp32doit-espduino.menu.DebugLevel.none=None
esp32doit-espduino.menu.DebugLevel.none.build.code_debug=0
esp32doit-espduino.menu.DebugLevel.error=Error
esp32doit-espduino.menu.DebugLevel.error.build.code_debug=1
esp32doit-espduino.menu.DebugLevel.warn=Warn
esp32doit-espduino.menu.DebugLevel.warn.build.code_debug=2
esp32doit-espduino.menu.DebugLevel.info=Info
esp32doit-espduino.menu.DebugLevel.info.build.code_debug=3
esp32doit-espduino.menu.DebugLevel.debug=Debug
esp32doit-espduino.menu.DebugLevel.debug.build.code_debug=4

##############################################################

esp32-evb.name=OLIMEX ESP32-EVB

esp32-evb.upload.tool=esptool_py
esp32-evb.upload.maximum_size=1310720
esp32-evb.upload.maximum_data_size=327680
esp32-evb.upload.flags=
esp32-evb.upload.extra_flags=

esp32-evb.serial.disableDTR=true
esp32-evb.serial.disableRTS=true

esp32-evb.build.tarch=xtensa
esp32-evb.build.bootloader_addr=0x1000
esp32-evb.build.target=esp32
esp32-evb.build.mcu=esp32
esp32-evb.build.core=esp32
esp32-evb.build.variant=esp32-evb
esp32-evb.build.board=ESP32_EVB

esp32-evb.build.f_cpu=240000000L
esp32-evb.build.flash_mode=dio
esp32-evb.build.flash_size=4MB
esp32-evb.build.boot=dio
esp32-evb.build.partitions=default
esp32-evb.build.defines=

esp32-evb.menu.FlashFreq.80=80MHz
esp32-evb.menu.FlashFreq.80.build.flash_freq=80m
esp32-evb.menu.FlashFreq.40=40MHz
esp32-evb.menu.FlashFreq.40.build.flash_freq=40m


esp32-evb.menu.UploadSpeed.115200=115200
esp32-evb.menu.UploadSpeed.115200.upload.speed=115200

esp32-evb.menu.PartitionScheme.default=Default
esp32-evb.menu.PartitionScheme.default.build.partitions=default
esp32-evb.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-evb.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-evb.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-evb.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-evb.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-evb.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

##############################################################

esp32-gateway.name=OLIMEX ESP32-GATEWAY

esp32-gateway.upload.tool=esptool_py
esp32-gateway.upload.maximum_size=1310720
esp32-gateway.upload.maximum_data_size=327680
esp32-gateway.upload.flags=
esp32-gateway.upload.extra_flags=

esp32-gateway.serial.disableDTR=true
esp32-gateway.serial.disableRTS=true

esp32-gateway.build.tarch=xtensa
esp32-gateway.build.bootloader_addr=0x1000
esp32-gateway.build.target=esp32
esp32-gateway.build.mcu=esp32
esp32-gateway.build.core=esp32
esp32-gateway.build.variant=esp32-gateway
esp32-gateway.build.board=ESP32_GATEWAY
esp32-gateway.menu.Revision.RevC=Revision C or older
esp32-gateway.menu.Revision.RevC.build.board=ESP32_GATEWAY_C
esp32-gateway.menu.Revision.RevE=Revision E
esp32-gateway.menu.Revision.RevE.build.board=ESP32_GATEWAY_E
esp32-gateway.menu.Revision.RevF=Revision F
esp32-gateway.menu.Revision.RevF.build.board=ESP32_GATEWAY_F

esp32-gateway.build.f_cpu=240000000L
esp32-gateway.build.flash_mode=dio
esp32-gateway.build.flash_size=4MB
esp32-gateway.build.boot=dio
esp32-gateway.build.partitions=default
esp32-gateway.build.defines=

esp32-gateway.menu.FlashFreq.80=80MHz
esp32-gateway.menu.FlashFreq.80.build.flash_freq=80m
esp32-gateway.menu.FlashFreq.40=40MHz
esp32-gateway.menu.FlashFreq.40.build.flash_freq=40m


esp32-gateway.menu.UploadSpeed.115200=115200
esp32-gateway.menu.UploadSpeed.115200.upload.speed=115200

esp32-gateway.menu.PartitionScheme.default=Default
esp32-gateway.menu.PartitionScheme.default.build.partitions=default
esp32-gateway.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-gateway.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-gateway.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-gateway.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-gateway.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-gateway.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

##############################################################

esp32-poe.name=OLIMEX ESP32-PoE

esp32-poe.upload.tool=esptool_py
esp32-poe.upload.maximum_size=1310720
esp32-poe.upload.maximum_data_size=327680
esp32-poe.upload.flags=
esp32-poe.upload.extra_flags=

esp32-poe.serial.disableDTR=true
esp32-poe.serial.disableRTS=true

