espressif/arduino-esp32/boards.txt
##############################################################

m5stack-coreink.name=M5Stack-CoreInk

m5stack-coreink.upload.tool=esptool_py
m5stack-coreink.upload.maximum_size=1310720
m5stack-coreink.upload.maximum_data_size=327680
m5stack-coreink.upload.wait_for_upload_port=true
m5stack-coreink.upload.flags=
m5stack-coreink.upload.extra_flags=

m5stack-coreink.serial.disableDTR=true
m5stack-coreink.serial.disableRTS=true

m5stack-coreink.build.tarch=xtensa
m5stack-coreink.build.bootloader_addr=0x1000
m5stack-coreink.build.target=esp32
m5stack-coreink.build.mcu=esp32
m5stack-coreink.build.core=esp32
m5stack-coreink.build.variant=m5stack_coreink
m5stack-coreink.build.board=M5Stack_CoreInk

m5stack-coreink.build.f_cpu=240000000L
m5stack-coreink.build.flash_size=4MB
m5stack-coreink.build.flash_freq=80m
m5stack-coreink.build.flash_mode=dio
m5stack-coreink.build.boot=dio
m5stack-coreink.build.partitions=default
m5stack-coreink.build.defines=

m5stack-coreink.menu.PartitionScheme.default=Default
m5stack-coreink.menu.PartitionScheme.default.build.partitions=default
m5stack-coreink.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-coreink.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-coreink.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-coreink.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-coreink.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-coreink.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-coreink.menu.UploadSpeed.921600=921600
m5stack-coreink.menu.UploadSpeed.921600.upload.speed=921600
m5stack-coreink.menu.UploadSpeed.115200=115200
m5stack-coreink.menu.UploadSpeed.115200.upload.speed=115200
m5stack-coreink.menu.UploadSpeed.256000.windows=256000
m5stack-coreink.menu.UploadSpeed.256000.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400=230400
m5stack-coreink.menu.UploadSpeed.230400.upload.speed=230400
m5stack-coreink.menu.UploadSpeed.460800.linux=460800
m5stack-coreink.menu.UploadSpeed.460800.macosx=460800
m5stack-coreink.menu.UploadSpeed.460800.upload.speed=460800
m5stack-coreink.menu.UploadSpeed.512000.windows=512000
m5stack-coreink.menu.UploadSpeed.512000.upload.speed=512000
m5stack-coreink.menu.UploadSpeed.1500000=1500000
m5stack-coreink.menu.UploadSpeed.1500000.upload.speed=1500000

m5stack-coreink.menu.DebugLevel.none=None
m5stack-coreink.menu.DebugLevel.none.build.code_debug=0
m5stack-coreink.menu.DebugLevel.error=Error
m5stack-coreink.menu.DebugLevel.error.build.code_debug=1
m5stack-coreink.menu.DebugLevel.warn=Warn
m5stack-coreink.menu.DebugLevel.warn.build.code_debug=2
m5stack-coreink.menu.DebugLevel.info=Info
m5stack-coreink.menu.DebugLevel.info.build.code_debug=3
m5stack-coreink.menu.DebugLevel.debug=Debug
m5stack-coreink.menu.DebugLevel.debug.build.code_debug=4
m5stack-coreink.menu.DebugLevel.verbose=Verbose
m5stack-coreink.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

odroid_esp32.name=ODROID ESP32

odroid_esp32.upload.tool=esptool_py
odroid_esp32.upload.maximum_size=1310720
odroid_esp32.upload.maximum_data_size=327680
odroid_esp32.upload.flags=
odroid_esp32.upload.extra_flags=

odroid_esp32.serial.disableDTR=true
odroid_esp32.serial.disableRTS=true

odroid_esp32.build.tarch=xtensa
odroid_esp32.build.bootloader_addr=0x1000
odroid_esp32.build.target=esp32
odroid_esp32.build.mcu=esp32
odroid_esp32.build.core=esp32
odroid_esp32.build.variant=odroid_esp32
odroid_esp32.build.board=ODROID_ESP32

odroid_esp32.build.f_cpu=240000000L
odroid_esp32.build.flash_size=16MB
odroid_esp32.build.flash_mode=dio
odroid_esp32.build.boot=dio
odroid_esp32.build.partitions=default
odroid_esp32.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
odroid_esp32.build.extra_libs=

odroid_esp32.menu.FlashMode.qio=QIO
odroid_esp32.menu.FlashMode.qio.build.flash_mode=dio
odroid_esp32.menu.FlashMode.qio.build.boot=qio
odroid_esp32.menu.FlashMode.dio=DIO
odroid_esp32.menu.FlashMode.dio.build.flash_mode=dio
odroid_esp32.menu.FlashMode.dio.build.boot=dio
odroid_esp32.menu.FlashMode.qout=QOUT
odroid_esp32.menu.FlashMode.qout.build.flash_mode=dout
odroid_esp32.menu.FlashMode.qout.build.boot=qout
odroid_esp32.menu.FlashMode.dout=DOUT
odroid_esp32.menu.FlashMode.dout.build.flash_mode=dout
odroid_esp32.menu.FlashMode.dout.build.boot=dout

odroid_esp32.menu.FlashFreq.80=80MHz
odroid_esp32.menu.FlashFreq.80.build.flash_freq=80m
odroid_esp32.menu.FlashFreq.40=40MHz
odroid_esp32.menu.FlashFreq.40.build.flash_freq=40m

odroid_esp32.menu.PartitionScheme.default=Default
odroid_esp32.menu.PartitionScheme.default.build.partitions=default
odroid_esp32.menu.PartitionScheme.no_ota=No OTA (Large APP)
odroid_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
odroid_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
odroid_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
odroid_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
odroid_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

odroid_esp32.menu.UploadSpeed.921600=921600
odroid_esp32.menu.UploadSpeed.921600.upload.speed=921600
odroid_esp32.menu.UploadSpeed.115200=115200
odroid_esp32.menu.UploadSpeed.115200.upload.speed=115200
odroid_esp32.menu.UploadSpeed.256000.windows=256000
odroid_esp32.menu.UploadSpeed.256000.upload.speed=256000
odroid_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
odroid_esp32.menu.UploadSpeed.230400=230400
odroid_esp32.menu.UploadSpeed.230400.upload.speed=230400
odroid_esp32.menu.UploadSpeed.460800.linux=460800
odroid_esp32.menu.UploadSpeed.460800.macosx=460800
odroid_esp32.menu.UploadSpeed.460800.upload.speed=460800
odroid_esp32.menu.UploadSpeed.512000.windows=512000
odroid_esp32.menu.UploadSpeed.512000.upload.speed=512000

odroid_esp32.menu.DebugLevel.none=None
odroid_esp32.menu.DebugLevel.none.build.code_debug=0
odroid_esp32.menu.DebugLevel.error=Error
odroid_esp32.menu.DebugLevel.error.build.code_debug=1
odroid_esp32.menu.DebugLevel.warn=Warn
odroid_esp32.menu.DebugLevel.warn.build.code_debug=2
odroid_esp32.menu.DebugLevel.info=Info
odroid_esp32.menu.DebugLevel.info.build.code_debug=3
odroid_esp32.menu.DebugLevel.debug=Debug
odroid_esp32.menu.DebugLevel.debug.build.code_debug=4
odroid_esp32.menu.DebugLevel.verbose=Verbose
odroid_esp32.menu.DebugLevel.verbose.build.code_debug=5

