espressif/arduino-esp32/boards.txt
##############################################################


alksesp32.name=ALKS ESP32

alksesp32.upload.tool=esptool_py
alksesp32.upload.maximum_size=1310720
alksesp32.upload.maximum_data_size=327680
alksesp32.upload.flags=
alksesp32.upload.extra_flags=

alksesp32.serial.disableDTR=true
alksesp32.serial.disableRTS=true

alksesp32.build.tarch=xtensa
alksesp32.build.bootloader_addr=0x1000
alksesp32.build.target=esp32
alksesp32.build.mcu=esp32
alksesp32.build.core=esp32
alksesp32.build.variant=alksesp32
alksesp32.build.board=ALKS

alksesp32.build.f_cpu=240000000L
alksesp32.build.flash_size=4MB
alksesp32.build.flash_freq=40m
alksesp32.build.flash_mode=dio
alksesp32.build.boot=dio
alksesp32.build.partitions=default
alksesp32.build.defines=

alksesp32.menu.PSRAM.disabled=Disabled
alksesp32.menu.PSRAM.disabled.build.defines=
alksesp32.menu.PSRAM.disabled.build.extra_libs=
alksesp32.menu.PSRAM.enabled=Enabled
alksesp32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
alksesp32.menu.PSRAM.enabled.build.extra_libs=

alksesp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
alksesp32.menu.PartitionScheme.default.build.partitions=default
alksesp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
alksesp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
alksesp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
alksesp32.menu.PartitionScheme.minimal.build.partitions=minimal
alksesp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
alksesp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
alksesp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
alksesp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
alksesp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
alksesp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
alksesp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
alksesp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
alksesp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
alksesp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
alksesp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
alksesp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
alksesp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
alksesp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
alksesp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
alksesp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
alksesp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
alksesp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
alksesp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
alksesp32.menu.PartitionScheme.fatflash.build.partitions=ffat

alksesp32.menu.CPUFreq.240=240MHz (WiFi/BT)
alksesp32.menu.CPUFreq.240.build.f_cpu=240000000L
alksesp32.menu.CPUFreq.160=160MHz (WiFi/BT)
alksesp32.menu.CPUFreq.160.build.f_cpu=160000000L
alksesp32.menu.CPUFreq.80=80MHz (WiFi/BT)
alksesp32.menu.CPUFreq.80.build.f_cpu=80000000L
alksesp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.40.build.f_cpu=40000000L
alksesp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
alksesp32.menu.CPUFreq.26.build.f_cpu=26000000L
alksesp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.20.build.f_cpu=20000000L
alksesp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
alksesp32.menu.CPUFreq.13.build.f_cpu=13000000L
alksesp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.10.build.f_cpu=10000000L

alksesp32.menu.FlashMode.qio=QIO
alksesp32.menu.FlashMode.qio.build.flash_mode=dio
alksesp32.menu.FlashMode.qio.build.boot=qio
alksesp32.menu.FlashMode.dio=DIO
alksesp32.menu.FlashMode.dio.build.flash_mode=dio
alksesp32.menu.FlashMode.dio.build.boot=dio
alksesp32.menu.FlashMode.qout=QOUT
alksesp32.menu.FlashMode.qout.build.flash_mode=dout
alksesp32.menu.FlashMode.qout.build.boot=qout
alksesp32.menu.FlashMode.dout=DOUT
alksesp32.menu.FlashMode.dout.build.flash_mode=dout
alksesp32.menu.FlashMode.dout.build.boot=dout

alksesp32.menu.FlashFreq.80=80MHz
alksesp32.menu.FlashFreq.80.build.flash_freq=80m
alksesp32.menu.FlashFreq.40=40MHz
alksesp32.menu.FlashFreq.40.build.flash_freq=40m

alksesp32.menu.FlashSize.4M=4MB (32Mb)
alksesp32.menu.FlashSize.4M.build.flash_size=4MB
alksesp32.menu.FlashSize.2M=2MB (16Mb)
alksesp32.menu.FlashSize.2M.build.flash_size=2MB
alksesp32.menu.FlashSize.2M.build.partitions=minimal
alksesp32.menu.FlashSize.16M=16MB (128Mb)
alksesp32.menu.FlashSize.16M.build.flash_size=16MB
alksesp32.menu.FlashSize.16M.build.partitions=ffat

alksesp32.menu.UploadSpeed.921600=921600
alksesp32.menu.UploadSpeed.921600.upload.speed=921600
alksesp32.menu.UploadSpeed.115200=115200
alksesp32.menu.UploadSpeed.115200.upload.speed=115200
alksesp32.menu.UploadSpeed.256000.windows=256000
alksesp32.menu.UploadSpeed.256000.upload.speed=256000
alksesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
alksesp32.menu.UploadSpeed.230400=230400
alksesp32.menu.UploadSpeed.230400.upload.speed=230400
alksesp32.menu.UploadSpeed.460800.linux=460800
alksesp32.menu.UploadSpeed.460800.macosx=460800
alksesp32.menu.UploadSpeed.460800.upload.speed=460800
alksesp32.menu.UploadSpeed.512000.windows=512000
alksesp32.menu.UploadSpeed.512000.upload.speed=512000

alksesp32.menu.DebugLevel.none=None
alksesp32.menu.DebugLevel.none.build.code_debug=0
alksesp32.menu.DebugLevel.error=Error
alksesp32.menu.DebugLevel.error.build.code_debug=1
alksesp32.menu.DebugLevel.warn=Warn
alksesp32.menu.DebugLevel.warn.build.code_debug=2
alksesp32.menu.DebugLevel.info=Info
alksesp32.menu.DebugLevel.info.build.code_debug=3
alksesp32.menu.DebugLevel.debug=Debug
alksesp32.menu.DebugLevel.debug.build.code_debug=4
alksesp32.menu.DebugLevel.verbose=Verbose
alksesp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################


wipy3.name=WiPy 3.0

wipy3.upload.tool=esptool_py
wipy3.upload.maximum_size=1310720
wipy3.upload.maximum_data_size=294912
wipy3.upload.flags=
wipy3.upload.extra_flags=

