espressif/arduino-esp32/boards.txt
##############################################################

twatch.name=TTGO T-Watch

twatch.upload.tool=esptool_py
twatch.upload.maximum_size=6553600
twatch.upload.maximum_data_size=4521984
twatch.upload.wait_for_upload_port=true
twatch.upload.flags=
twatch.upload.extra_flags=

twatch.serial.disableDTR=true
twatch.serial.disableRTS=true

twatch.build.tarch=xtensa
twatch.build.bootloader_addr=0x1000
twatch.build.target=esp32
twatch.build.mcu=esp32
twatch.build.core=esp32
twatch.build.variant=twatch
twatch.build.board=TWatch

twatch.menu.Revision.TWATCH_BASE=T-Watch Base
twatch.menu.Revision.TWATCH_BASE.build.board=TWATCH_BASE
twatch.menu.Revision.TWATCH_2020_V1=T-Watch-2020-V1
twatch.menu.Revision.TWATCH_2020_V1.build.board=TWATCH_2020_V1
twatch.menu.Revision.TWATCH_2020_V2=T-Watch-2020-V2
twatch.menu.Revision.TWATCH_2020_V2.build.board=TWATCH_2020_V2
twatch.menu.Revision.TWATCH_2020_V3=T-Watch-2020-V3
twatch.menu.Revision.TWATCH_2020_V3.build.board=TWATCH_2020_V3

twatch.build.f_cpu=240000000L
twatch.build.flash_size=16MB
twatch.build.flash_freq=80m
twatch.build.flash_mode=dio
twatch.build.boot=dio
twatch.build.partitions=default_16MB
twatch.build.defines=

twatch.menu.PSRAM.enabled=Enabled
twatch.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
twatch.menu.PSRAM.enabled.build.extra_libs=
twatch.menu.PSRAM.disabled=Disabled
twatch.menu.PSRAM.disabled.build.defines=
twatch.menu.PSRAM.disabled.build.extra_libs=

twatch.menu.PartitionScheme.default=Default (2 x 6.5 MB app, 3.6 MB SPIFFS)
twatch.menu.PartitionScheme.default.build.partitions=default_16MB
twatch.menu.PartitionScheme.default.upload.maximum_size=6553600
twatch.menu.PartitionScheme.large_spiffs=Large SPIFFS (7 MB)
twatch.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
twatch.menu.PartitionScheme.large_spiffs.upload.maximum_size=4685824

twatch.menu.UploadSpeed.2000000=2000000
twatch.menu.UploadSpeed.2000000.upload.speed=2000000
twatch.menu.UploadSpeed.1152000=1152000
twatch.menu.UploadSpeed.1152000.upload.speed=1152000
twatch.menu.UploadSpeed.921600=921600
twatch.menu.UploadSpeed.921600.upload.speed=921600
twatch.menu.UploadSpeed.115200=115200
twatch.menu.UploadSpeed.115200.upload.speed=115200
twatch.menu.UploadSpeed.256000.windows=256000
twatch.menu.UploadSpeed.256000.upload.speed=256000
twatch.menu.UploadSpeed.230400.windows.upload.speed=256000
twatch.menu.UploadSpeed.230400=230400
twatch.menu.UploadSpeed.230400.upload.speed=230400
twatch.menu.UploadSpeed.460800.linux=460800
twatch.menu.UploadSpeed.460800.macosx=460800
twatch.menu.UploadSpeed.460800.upload.speed=460800
twatch.menu.UploadSpeed.512000.windows=512000
twatch.menu.UploadSpeed.512000.upload.speed=512000

twatch.menu.DebugLevel.none=None
twatch.menu.DebugLevel.none.build.code_debug=0
twatch.menu.DebugLevel.error=Error
twatch.menu.DebugLevel.error.build.code_debug=1
twatch.menu.DebugLevel.warn=Warn
twatch.menu.DebugLevel.warn.build.code_debug=2
twatch.menu.DebugLevel.info=Info
twatch.menu.DebugLevel.info.build.code_debug=3
twatch.menu.DebugLevel.debug=Debug
twatch.menu.DebugLevel.debug.build.code_debug=4
twatch.menu.DebugLevel.verbose=Verbose
twatch.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

d1_mini32.name=WEMOS D1 MINI ESP32

d1_mini32.upload.tool=esptool_py
d1_mini32.upload.maximum_size=1310720
d1_mini32.upload.maximum_data_size=327680
d1_mini32.upload.flags=
d1_mini32.upload.extra_flags=

d1_mini32.serial.disableDTR=true
d1_mini32.serial.disableRTS=true

d1_mini32.build.tarch=xtensa
d1_mini32.build.bootloader_addr=0x1000
d1_mini32.build.target=esp32
d1_mini32.build.mcu=esp32
d1_mini32.build.core=esp32
d1_mini32.build.variant=d1_mini32
d1_mini32.build.board=D1_MINI32

d1_mini32.build.f_cpu=240000000L
d1_mini32.build.flash_mode=dio
d1_mini32.build.flash_size=4MB
d1_mini32.build.boot=dio
d1_mini32.build.partitions=default
d1_mini32.build.defines=

d1_mini32.menu.FlashFreq.80=80MHz
d1_mini32.menu.FlashFreq.80.build.flash_freq=80m
d1_mini32.menu.FlashFreq.40=40MHz
d1_mini32.menu.FlashFreq.40.build.flash_freq=40m

d1_mini32.menu.PartitionScheme.default=Default
d1_mini32.menu.PartitionScheme.default.build.partitions=default
d1_mini32.menu.PartitionScheme.no_ota=No OTA (Large APP)
d1_mini32.menu.PartitionScheme.no_ota.build.partitions=no_ota
d1_mini32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d1_mini32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d1_mini32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d1_mini32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

d1_mini32.menu.CPUFreq.240=240MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.240.build.f_cpu=240000000L
d1_mini32.menu.CPUFreq.160=160MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.160.build.f_cpu=160000000L
d1_mini32.menu.CPUFreq.80=80MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.80.build.f_cpu=80000000L
d1_mini32.menu.CPUFreq.40=40MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.40.build.f_cpu=40000000L
d1_mini32.menu.CPUFreq.26=26MHz (26MHz XTAL)
d1_mini32.menu.CPUFreq.26.build.f_cpu=26000000L
d1_mini32.menu.CPUFreq.20=20MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.20.build.f_cpu=20000000L
d1_mini32.menu.CPUFreq.13=13MHz (26MHz XTAL)
d1_mini32.menu.CPUFreq.13.build.f_cpu=13000000L
d1_mini32.menu.CPUFreq.10=10MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.10.build.f_cpu=10000000L

d1_mini32.menu.UploadSpeed.921600=921600
d1_mini32.menu.UploadSpeed.921600.upload.speed=921600
d1_mini32.menu.UploadSpeed.115200=115200
d1_mini32.menu.UploadSpeed.115200.upload.speed=115200
d1_mini32.menu.UploadSpeed.256000.windows=256000
d1_mini32.menu.UploadSpeed.256000.upload.speed=256000
d1_mini32.menu.UploadSpeed.230400.windows.upload.speed=256000
d1_mini32.menu.UploadSpeed.230400=230400
d1_mini32.menu.UploadSpeed.230400.upload.speed=230400
d1_mini32.menu.UploadSpeed.460800.linux=460800
d1_mini32.menu.UploadSpeed.460800.macosx=460800
d1_mini32.menu.UploadSpeed.460800.upload.speed=460800
d1_mini32.menu.UploadSpeed.512000.windows=512000
d1_mini32.menu.UploadSpeed.512000.upload.speed=512000

