espressif/arduino-esp32/boards.txt
##############################################################

imbrios-logsens-v1p1.name=IMBRIOS LOGSENS_V1P1

imbrios-logsens-v1p1.upload.tool=esptool_py
imbrios-logsens-v1p1.upload.maximum_size=1310720
imbrios-logsens-v1p1.upload.maximum_data_size=327680
imbrios-logsens-v1p1.upload.wait_for_upload_port=true
imbrios-logsens-v1p1.upload.extra_flags=

imbrios-logsens-v1p1.serial.disableDTR=true
imbrios-logsens-v1p1.serial.disableRTS=true

imbrios-logsens-v1p1.build.tarch=xtensa
imbrios-logsens-v1p1.build.bootloader_addr=0x1000
imbrios-logsens-v1p1.build.target=esp32
imbrios-logsens-v1p1.build.mcu=esp32
imbrios-logsens-v1p1.build.core=esp32
imbrios-logsens-v1p1.build.variant=imbrios-logsens-v1p1
imbrios-logsens-v1p1.build.board=IMBRIOS_LOGSENS_V1P1

imbrios-logsens-v1p1.build.f_cpu=240000000L
imbrios-logsens-v1p1.build.flash_mode=dio
imbrios-logsens-v1p1.build.flash_size=4MB
imbrios-logsens-v1p1.build.boot=dio
imbrios-logsens-v1p1.build.partitions=default
imbrios-logsens-v1p1.build.defines=

imbrios-logsens-v1p1.menu.FlashFreq.80=80MHz
imbrios-logsens-v1p1.menu.FlashFreq.80.build.flash_freq=80m
imbrios-logsens-v1p1.menu.FlashFreq.40=40MHz
imbrios-logsens-v1p1.menu.FlashFreq.40.build.flash_freq=40m

imbrios-logsens-v1p1.menu.PartitionScheme.default=Default
imbrios-logsens-v1p1.menu.PartitionScheme.default.build.partitions=default
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota=No OTA (Large APP)
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.build.partitions=no_ota
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

imbrios-logsens-v1p1.menu.CPUFreq.240=240MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.240.build.f_cpu=240000000L
imbrios-logsens-v1p1.menu.CPUFreq.160=160MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.160.build.f_cpu=160000000L
imbrios-logsens-v1p1.menu.CPUFreq.80=80MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.80.build.f_cpu=80000000L
imbrios-logsens-v1p1.menu.CPUFreq.40=40MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.40.build.f_cpu=40000000L
imbrios-logsens-v1p1.menu.CPUFreq.26=26MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.26.build.f_cpu=26000000L
imbrios-logsens-v1p1.menu.CPUFreq.20=20MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.20.build.f_cpu=20000000L
imbrios-logsens-v1p1.menu.CPUFreq.13=13MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.13.build.f_cpu=13000000L
imbrios-logsens-v1p1.menu.CPUFreq.10=10MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.10.build.f_cpu=10000000L

imbrios-logsens-v1p1.menu.UploadSpeed.921600=921600
imbrios-logsens-v1p1.menu.UploadSpeed.921600.upload.speed=921600
imbrios-logsens-v1p1.menu.UploadSpeed.115200=115200
imbrios-logsens-v1p1.menu.UploadSpeed.115200.upload.speed=115200
imbrios-logsens-v1p1.menu.UploadSpeed.256000.windows=256000
imbrios-logsens-v1p1.menu.UploadSpeed.256000.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400.windows.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400=230400
imbrios-logsens-v1p1.menu.UploadSpeed.230400.upload.speed=230400
imbrios-logsens-v1p1.menu.UploadSpeed.460800.linux=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.macosx=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.upload.speed=460800
imbrios-logsens-v1p1.menu.UploadSpeed.512000.windows=512000
imbrios-logsens-v1p1.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

healthypi4.name=ProtoCentral HealthyPi 4

healthypi4.upload.tool=esptool_py
healthypi4.upload.maximum_size=1310720
healthypi4.upload.maximum_data_size=327680
healthypi4.upload.wait_for_upload_port=true
healthypi4.upload.extra_flags=

healthypi4.serial.disableDTR=true
healthypi4.serial.disableRTS=true

healthypi4.build.tarch=xtensa
healthypi4.build.bootloader_addr=0x1000
healthypi4.build.target=esp32
healthypi4.build.mcu=esp32
healthypi4.build.core=esp32
healthypi4.build.variant=healthypi4
healthypi4.build.board=HEALTHYPI_4

healthypi4.build.f_cpu=240000000L
healthypi4.build.flash_mode=dio
healthypi4.build.flash_size=4MB
healthypi4.build.boot=dio
healthypi4.build.partitions=min_spiffs
healthypi4.build.defines=

healthypi4.menu.FlashFreq.80=80MHz
healthypi4.menu.FlashFreq.80.build.flash_freq=80m
healthypi4.menu.FlashFreq.40=40MHz
healthypi4.menu.FlashFreq.40.build.flash_freq=40m

healthypi4.menu.PartitionScheme.default=Default
healthypi4.menu.PartitionScheme.default.build.partitions=default
healthypi4.menu.PartitionScheme.no_ota=No OTA (Large APP)
healthypi4.menu.PartitionScheme.no_ota.build.partitions=no_ota
healthypi4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
healthypi4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
healthypi4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
healthypi4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

healthypi4.menu.UploadSpeed.921600=921600
healthypi4.menu.UploadSpeed.921600.upload.speed=921600
healthypi4.menu.UploadSpeed.115200=115200
healthypi4.menu.UploadSpeed.115200.upload.speed=115200
healthypi4.menu.UploadSpeed.256000.windows=256000
healthypi4.menu.UploadSpeed.256000.upload.speed=256000
healthypi4.menu.UploadSpeed.230400.windows.upload.speed=256000
healthypi4.menu.UploadSpeed.230400=230400
healthypi4.menu.UploadSpeed.230400.upload.speed=230400
healthypi4.menu.UploadSpeed.460800.linux=460800
healthypi4.menu.UploadSpeed.460800.macosx=460800
healthypi4.menu.UploadSpeed.460800.upload.speed=460800
healthypi4.menu.UploadSpeed.512000.windows=512000
healthypi4.menu.UploadSpeed.512000.upload.speed=512000

healthypi4.menu.DebugLevel.none=None
healthypi4.menu.DebugLevel.none.build.code_debug=0
healthypi4.menu.DebugLevel.error=Error
healthypi4.menu.DebugLevel.error.build.code_debug=1
healthypi4.menu.DebugLevel.warn=Warn
healthypi4.menu.DebugLevel.warn.build.code_debug=2
healthypi4.menu.DebugLevel.info=Info
healthypi4.menu.DebugLevel.info.build.code_debug=3
healthypi4.menu.DebugLevel.debug=Debug
healthypi4.menu.DebugLevel.debug.build.code_debug=4
healthypi4.menu.DebugLevel.verbose=Verbose
healthypi4.menu.DebugLevel.verbose.build.code_debug=5

