espressif/arduino-esp32/boards.txt
##############################################################


ET-Board.name=ET-Board

ET-Board.upload.tool=esptool_py
ET-Board.upload.maximum_size=1310720
ET-Board.upload.maximum_data_size=327680
ET-Board.upload.wait_for_upload_port=true
ET-Board.upload.extra_flags=

ET-Board.serial.disableDTR=true
ET-Board.serial.disableRTS=true

ET-Board.build.tarch=xtensa
ET-Board.build.bootloader_addr=0x1000
ET-Board.build.target=esp32
ET-Board.build.mcu=esp32
ET-Board.build.core=esp32
ET-Board.build.variant=ET-Board
ET-Board.build.board=ET-Board
ET-Board.build.f_cpu=240000000L
ET-Board.build.flash_mode=dio
ET-Board.build.flash_size=4MB
ET-Board.build.boot=dio
ET-Board.build.partitions=default
ET-Board.build.defines=

ET-Board.menu.PartitionScheme.default=Default
ET-Board.menu.PartitionScheme.default.build.partitions=default
ET-Board.menu.PartitionScheme.no_ota=No OTA (Large APP)
ET-Board.menu.PartitionScheme.no_ota.build.partitions=no_ota
ET-Board.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ET-Board.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ET-Board.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ET-Board.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ET-Board.menu.FlashFreq.80=80MHz
ET-Board.menu.FlashFreq.80.build.flash_freq=80m
ET-Board.menu.FlashFreq.40=40MHz
ET-Board.menu.FlashFreq.40.build.flash_freq=40m

ET-Board.menu.UploadSpeed.921600=921600
ET-Board.menu.UploadSpeed.921600.upload.speed=921600
ET-Board.menu.UploadSpeed.115200=115200
ET-Board.menu.UploadSpeed.115200.upload.speed=115200
ET-Board.menu.UploadSpeed.256000.windows=256000
ET-Board.menu.UploadSpeed.256000.upload.speed=256000
ET-Board.menu.UploadSpeed.230400.windows.upload.speed=256000
ET-Board.menu.UploadSpeed.230400=230400
ET-Board.menu.UploadSpeed.230400.upload.speed=230400
ET-Board.menu.UploadSpeed.460800.linux=460800
ET-Board.menu.UploadSpeed.460800.macosx=460800
ET-Board.menu.UploadSpeed.460800.upload.speed=460800
ET-Board.menu.UploadSpeed.512000.windows=512000
ET-Board.menu.UploadSpeed.512000.upload.speed=512000

ET-Board.menu.DebugLevel.none=None
ET-Board.menu.DebugLevel.none.build.code_debug=0
ET-Board.menu.DebugLevel.error=Error
ET-Board.menu.DebugLevel.error.build.code_debug=1
ET-Board.menu.DebugLevel.warn=Warn
ET-Board.menu.DebugLevel.warn.build.code_debug=2
ET-Board.menu.DebugLevel.info=Info
ET-Board.menu.DebugLevel.info.build.code_debug=3
ET-Board.menu.DebugLevel.debug=Debug
ET-Board.menu.DebugLevel.debug.build.code_debug=4
ET-Board.menu.DebugLevel.verbose=Verbose
ET-Board.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

ch_denky.name=Denky

ch_denky.upload.tool=esptool_py
ch_denky.upload.maximum_size=1310720
ch_denky.upload.maximum_data_size=327680
ch_denky.upload.flags=
ch_denky.upload.extra_flags=

ch_denky.serial.disableDTR=true
ch_denky.serial.disableRTS=true

ch_denky.build.tarch=xtensa
ch_denky.build.bootloader_addr=0x1000
ch_denky.build.target=esp32
ch_denky.build.mcu=esp32
ch_denky.build.core=esp32
ch_denky.build.variant=ch_denky
ch_denky.build.board=DENKY

ch_denky.build.f_cpu=240000000L
ch_denky.build.flash_size=4MB
ch_denky.build.flash_freq=80m
ch_denky.build.flash_mode=dio
ch_denky.build.boot=dio
ch_denky.build.partitions=default
ch_denky.build.defines=

ch_denky.menu.Revision.denkyd4=PICO-V3-02
ch_denky.menu.Revision.denkyd4.build.board=DENKY_PICOV3
ch_denky.menu.Revision.denkyd4.build.flash_size=8MB
ch_denky.menu.Revision.denky32=WROOM32
ch_denky.menu.Revision.denky32.build.board=DENKY_WROOM32
ch_denky.menu.Revision.denkyd4.build.flash_size=4MB

ch_denky.menu.PartitionScheme.default=Default
ch_denky.menu.PartitionScheme.default.build.partitions=default
ch_denky.menu.PartitionScheme.no_ota=No OTA (Large APP)
ch_denky.menu.PartitionScheme.no_ota.build.partitions=no_ota
ch_denky.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ch_denky.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ch_denky.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ch_denky.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ch_denky.menu.UploadSpeed.921600=921600
ch_denky.menu.UploadSpeed.921600.upload.speed=921600
ch_denky.menu.UploadSpeed.115200=115200
ch_denky.menu.UploadSpeed.115200.upload.speed=115200
ch_denky.menu.UploadSpeed.256000.windows=256000
ch_denky.menu.UploadSpeed.256000.upload.speed=256000
ch_denky.menu.UploadSpeed.230400.windows.upload.speed=256000
ch_denky.menu.UploadSpeed.230400=230400
ch_denky.menu.UploadSpeed.230400.upload.speed=230400
ch_denky.menu.UploadSpeed.460800.linux=460800
ch_denky.menu.UploadSpeed.460800.macosx=460800
ch_denky.menu.UploadSpeed.460800.upload.speed=460800
ch_denky.menu.UploadSpeed.512000.windows=512000
ch_denky.menu.UploadSpeed.512000.upload.speed=512000

ch_denky.menu.PSRAM.enabled=Enabled
ch_denky.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
ch_denky.menu.PSRAM.enabled.build.extra_libs=
ch_denky.menu.PSRAM.disabled=Disabled
ch_denky.menu.PSRAM.disabled.build.defines=
ch_denky.menu.PSRAM.disabled.build.extra_libs=

ch_denky.menu.DebugLevel.none=None
ch_denky.menu.DebugLevel.none.build.code_debug=0
ch_denky.menu.DebugLevel.error=Error
ch_denky.menu.DebugLevel.error.build.code_debug=1
ch_denky.menu.DebugLevel.warn=Warn
ch_denky.menu.DebugLevel.warn.build.code_debug=2
ch_denky.menu.DebugLevel.info=Info
ch_denky.menu.DebugLevel.info.build.code_debug=3
ch_denky.menu.DebugLevel.debug=Debug
ch_denky.menu.DebugLevel.debug.build.code_debug=4
ch_denky.menu.DebugLevel.verbose=Verbose
ch_denky.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

kb32.name=KB32-FT

kb32.upload.tool=esptool_py
kb32.upload.maximum_size=1310720
kb32.upload.maximum_data_size=327680
kb32.upload.wait_for_upload_port=true

kb32.serial.disableDTR=true
kb32.serial.disableRTS=true

kb32.build.mcu=esp32
kb32.build.core=esp32
kb32.build.variant=esp32
kb32.build.board=ESP32_DEV

kb32.build.f_cpu=240000000L
kb32.build.flash_size=4MB
kb32.build.flash_freq=40m
kb32.build.flash_mode=dio
kb32.build.boot=dio
kb32.build.partitions=default
kb32.build.defines=

kb32.menu.PSRAM.disabled=Disabled
kb32.menu.PSRAM.disabled.build.defines=
kb32.menu.PSRAM.disabled.build.extra_libs=
kb32.menu.PSRAM.enabled=Enabled
kb32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
kb32.menu.PSRAM.enabled.build.extra_libs=-lc-psram-workaround -lm-psram-workaround

