espressif/arduino-esp32/boards.txt
kb32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
kb32.menu.PartitionScheme.default.build.partitions=default
kb32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
kb32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
kb32.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
kb32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
kb32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
kb32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
kb32.menu.PartitionScheme.minimal.build.partitions=minimal
kb32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
kb32.menu.PartitionScheme.no_ota.build.partitions=no_ota
kb32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
kb32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
kb32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
kb32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
kb32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
kb32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
kb32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
kb32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
kb32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
kb32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
kb32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
kb32.menu.PartitionScheme.huge_app.build.partitions=huge_app
kb32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
kb32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
kb32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
kb32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
kb32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
kb32.menu.PartitionScheme.fatflash.build.partitions=ffat
kb32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
kb32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
kb32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
kb32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

kb32.menu.CPUFreq.240=240MHz (WiFi/BT)
kb32.menu.CPUFreq.240.build.f_cpu=240000000L
kb32.menu.CPUFreq.160=160MHz (WiFi/BT)
kb32.menu.CPUFreq.160.build.f_cpu=160000000L
kb32.menu.CPUFreq.80=80MHz (WiFi/BT)
kb32.menu.CPUFreq.80.build.f_cpu=80000000L
kb32.menu.CPUFreq.40=40MHz (40MHz XTAL)
kb32.menu.CPUFreq.40.build.f_cpu=40000000L
kb32.menu.CPUFreq.26=26MHz (26MHz XTAL)
kb32.menu.CPUFreq.26.build.f_cpu=26000000L
kb32.menu.CPUFreq.20=20MHz (40MHz XTAL)
kb32.menu.CPUFreq.20.build.f_cpu=20000000L
kb32.menu.CPUFreq.13=13MHz (26MHz XTAL)
kb32.menu.CPUFreq.13.build.f_cpu=13000000L
kb32.menu.CPUFreq.10=10MHz (40MHz XTAL)
kb32.menu.CPUFreq.10.build.f_cpu=10000000L

kb32.menu.FlashMode.qio=QIO
kb32.menu.FlashMode.qio.build.flash_mode=dio
kb32.menu.FlashMode.qio.build.boot=qio
kb32.menu.FlashMode.dio=DIO
kb32.menu.FlashMode.dio.build.flash_mode=dio
kb32.menu.FlashMode.dio.build.boot=dio
kb32.menu.FlashMode.qout=QOUT
kb32.menu.FlashMode.qout.build.flash_mode=dout
kb32.menu.FlashMode.qout.build.boot=qout
kb32.menu.FlashMode.dout=DOUT
kb32.menu.FlashMode.dout.build.flash_mode=dout
kb32.menu.FlashMode.dout.build.boot=dout

kb32.menu.FlashFreq.80=80MHz
kb32.menu.FlashFreq.80.build.flash_freq=80m
kb32.menu.FlashFreq.40=40MHz
kb32.menu.FlashFreq.40.build.flash_freq=40m

kb32.menu.FlashSize.4M=4MB (32Mb)
kb32.menu.FlashSize.4M.build.flash_size=4MB
kb32.menu.FlashSize.8M=8MB (64Mb)
kb32.menu.FlashSize.8M.build.flash_size=8MB
kb32.menu.FlashSize.8M.build.partitions=default_8MB
kb32.menu.FlashSize.2M=2MB (16Mb)
kb32.menu.FlashSize.2M.build.flash_size=2MB
kb32.menu.FlashSize.2M.build.partitions=minimal
kb32.menu.FlashSize.16M=16MB (128Mb)
kb32.menu.FlashSize.16M.build.flash_size=16MB

kb32.menu.UploadSpeed.921600=921600
kb32.menu.UploadSpeed.921600.upload.speed=921600
kb32.menu.UploadSpeed.115200=115200
kb32.menu.UploadSpeed.115200.upload.speed=115200
kb32.menu.UploadSpeed.256000.windows=256000
kb32.menu.UploadSpeed.256000.upload.speed=256000
kb32.menu.UploadSpeed.230400.windows.upload.speed=256000
kb32.menu.UploadSpeed.230400=230400
kb32.menu.UploadSpeed.230400.upload.speed=230400
kb32.menu.UploadSpeed.460800.linux=460800
kb32.menu.UploadSpeed.460800.macosx=460800
kb32.menu.UploadSpeed.460800.upload.speed=460800
kb32.menu.UploadSpeed.512000.windows=512000
kb32.menu.UploadSpeed.512000.upload.speed=512000

kb32.menu.DebugLevel.none=None
kb32.menu.DebugLevel.none.build.code_debug=0
kb32.menu.DebugLevel.error=Error
kb32.menu.DebugLevel.error.build.code_debug=1
kb32.menu.DebugLevel.warn=Warn
kb32.menu.DebugLevel.warn.build.code_debug=2
kb32.menu.DebugLevel.info=Info
kb32.menu.DebugLevel.info.build.code_debug=3
kb32.menu.DebugLevel.debug=Debug
kb32.menu.DebugLevel.debug.build.code_debug=4
kb32.menu.DebugLevel.verbose=Verbose
kb32.menu.DebugLevel.verbose.build.code_debug=5
